[
  {
    "id": "US-001",
    "title": "Compact skill index with path shortening",
    "story": "As an LLM agent, I want the SKILL_INDEX section to use a compact single-line format with one instruction banner and shortened paths so that I spend less of my context window on structural overhead and more on the actual conversation.",
    "acceptance_criteria": [
      "Instruction banner appears exactly once at the top of SKILL_INDEX",
      "Base path convention documented in header, each skill uses shortened relative path",
      "Each skill is a single line with ID, name, description, and relative path",
      "All skill information from the verbose format is preserved or reconstructable",
      "SKILL_INDEX section reduced by at least 50%"
    ],
    "priority": "Must Have",
    "traces": ["FR-001", "FR-002"]
  },
  {
    "id": "US-002",
    "title": "Lean persona content in session cache",
    "story": "As the SDLC orchestrator, I want the ROUNDTABLE_CONTEXT persona content to contain only voice-critical sections so that the session cache is smaller without losing the persona information needed for roundtable analysis dispatch.",
    "acceptance_criteria": [
      "Persona content retains Identity, Principles, Voice Integrity, Interaction Style",
      "Sections redundant with roundtable lead system prompt are stripped (including Analytical Approach)",
      "Persona heading delimiters are preserved for extraction",
      "Self-validation is compacted into a single checklist",
      "Per-persona content reduced by at least 50%"
    ],
    "priority": "Must Have",
    "traces": ["FR-003", "FR-004"]
  },
  {
    "id": "US-003",
    "title": "Lean topic content in session cache",
    "story": "As the SDLC orchestrator, I want topic file metadata (YAML frontmatter, depth guidance, source step files) stripped from the cached content so that only the analytical knowledge and validation criteria consume context budget.",
    "acceptance_criteria": [
      "Topic content has no YAML frontmatter",
      "Topic content has no depth_guidance or source_step_files",
      "Analytical Knowledge, Validation Criteria, and Artifact Instructions are preserved",
      "Topic heading delimiters are preserved for extraction",
      "Combined ROUNDTABLE_CONTEXT reduction of at least 40%"
    ],
    "priority": "Must Have",
    "traces": ["FR-005"]
  },
  {
    "id": "US-004",
    "title": "Aggressively condensed discovery context",
    "story": "As an LLM agent, I want the DISCOVERY_CONTEXT section to preserve all tables, headings, and lists while stripping all narrative prose so that I get the same structured project knowledge in significantly fewer tokens.",
    "acceptance_criteria": [
      "All tables (architecture, tech stack, test health) are preserved verbatim",
      "All headings and list items are preserved",
      "Prose paragraphs are stripped entirely",
      "Section is reduced by at least 40%"
    ],
    "priority": "Must Have",
    "traces": ["FR-006"]
  },
  {
    "id": "US-005",
    "title": "Safe tightening with fail-open fallback",
    "story": "As a framework developer, I want each tightening function to fail open to verbose content so that a bug in tightening never breaks the session cache or causes empty sections.",
    "acceptance_criteria": [
      "Each tightening function returns original content on any error",
      "A failed tightening does not prevent other sections from being tightened",
      "Verbose mode logs a warning on fallback"
    ],
    "priority": "Must Have",
    "traces": ["FR-007"]
  },
  {
    "id": "US-006",
    "title": "Reduction reporting in verbose mode",
    "story": "As a framework developer, I want to see per-section character savings when rebuilding the cache in verbose mode so that I can verify the tightening is achieving the 25-30% target reduction.",
    "acceptance_criteria": [
      "Verbose mode shows per-section before/after/reduction stats",
      "Verbose mode shows total markdown reduction summary",
      "Stats are written to stderr"
    ],
    "priority": "Should Have",
    "traces": ["FR-008"]
  }
]
